xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Include/nano1xx_pdma.h
/******************************************************************************
 * @file     nano1xx_pdma.h
 * @brief    NANO1xx PDMA driver header file
 * @version  1.0.1
 * @date     04, September, 2012
 *
 * @note
 * Copyright (C) 2012-2014 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#ifndef __NANO1XX_PDMA_H
#define __NANO1XX_PDMA_H

/*---------------------------------------------------------------------------------------------------------*/
/* Includes of local headers                                                                               */
/*---------------------------------------------------------------------------------------------------------*/
#include "nano1xx.h"


#ifdef  __cplusplus
extern "C"
{
#endif


/** @addtogroup NANO1xx_Device_Driver NANO1xx Device Driver
  @{
*/

/** @addtogroup NANO1xx_PDMA_Driver PDMA Driver
  @{
*/


/******************************************************************************/
/*                DMA Specific Macros                                         */
/******************************************************************************/
/** @addtogroup NANO1xx_PDMA_EXPORTED_CONSTANTS PDMA Exported Constants
  @{
*/

/*!<Enable PDMA Channel 1 Service Selection */
#define PDMA_SPI0_TX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_SPI0_TX))
#define PDMA_SPI1_TX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_SPI1_TX))
#define PDMA_UART0_TX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_UART0_TX))
#define PDMA_UART1_TX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_UART1_TX))
#define PDMA_USB_TX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_USB_TX))
#define PDMA_I2S_TX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_I2S_TX))
#define PDMA_DAC0_TX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_DAC0_TX))
#define PDMA_DAC1_TX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_DAC1_TX))
#define PDMA_SPI2_TX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_SPI2_TX))
#define PDMA_TMR0_CH0_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_TMR0_CH0))
#define PDMA_TMR0_CH1_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_TMR0_CH1))
#define PDMA_TMR1_CH0_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_TMR1_CH0))
#define PDMA_TMR1_CH1_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_TMR1_CH1))

#define PDMA_SPI0_RX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_SPI0_RX))
#define PDMA_SPI1_RX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_SPI1_RX))
#define PDMA_UART0_RX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_UART0_RX))
#define PDMA_UART1_RX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_UART1_RX))
#define PDMA_USB_RX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_USB_RX))
#define PDMA_I2S_RX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_I2S_RX))
#define PDMA_ADC_TO_CH1()		((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_ADC))
#define PDMA_SPI2_RX_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_SPI2_RX))
#define PDMA_PWM0_CH0_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_PWM0_CH0))
#define PDMA_PWM0_CH2_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_PWM0_CH2))
#define PDMA_PWM1_CH0_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_PWM1_CH0))
#define PDMA_PWM1_CH2_TO_CH1()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH1_MASK | PDMA_CH1_PWM1_CH2))
#define PDMA_DISABLE_CH1()		((uint32_t)(PDMAGCR->PDSSR0 |= PDMA_CH1_DISABLE))

/*!<Enable PDMA Channel 2 Service Selection */
#define PDMA_SPI0_TX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_SPI0_TX))
#define PDMA_SPI1_TX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_SPI1_TX))
#define PDMA_UART0_TX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_UART0_TX))
#define PDMA_UART1_TX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_UART1_TX))
#define PDMA_USB_TX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_USB_TX))
#define PDMA_I2S_TX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_I2S_TX))
#define PDMA_DAC0_TX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_DAC0_TX))
#define PDMA_DAC1_TX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_DAC1_TX))
#define PDMA_SPI2_TX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_SPI2_TX))
#define PDMA_TMR0_CH0_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_TMR0_CH0))
#define PDMA_TMR0_CH1_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_TMR0_CH1))
#define PDMA_TMR1_CH0_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_TMR1_CH0))
#define PDMA_TMR1_CH1_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_TMR1_CH1))

#define PDMA_SPI0_RX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_SPI0_RX))
#define PDMA_SPI1_RX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_SPI1_RX))
#define PDMA_UART0_RX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_UART0_RX))
#define PDMA_UART1_RX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_UART1_RX))
#define PDMA_USB_RX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_USB_RX))
#define PDMA_I2S_RX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_I2S_RX))
#define PDMA_ADC_TO_CH2()		((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_ADC))
#define PDMA_SPI2_RX_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_SPI2_RX))
#define PDMA_PWM0_CH0_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_PWM0_CH0))
#define PDMA_PWM0_CH2_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_PWM0_CH2))
#define PDMA_PWM1_CH0_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_PWM1_CH0))
#define PDMA_PWM1_CH2_TO_CH2()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH2_MASK | PDMA_CH2_PWM1_CH2))
#define PDMA_DISABLE_CH2()		((uint32_t)(PDMAGCR->PDSSR0 |= PDMA_CH2_DISABLE))

/*!<Enable PDMA Channel 3 Service Selection */
#define PDMA_SPI0_TX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_SPI0_TX))
#define PDMA_SPI1_TX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_SPI1_TX))
#define PDMA_UART0_TX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_UART0_TX))
#define PDMA_UART1_TX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_UART1_TX))
#define PDMA_USB_TX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_USB_TX))
#define PDMA_I2S_TX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_I2S_TX))
#define PDMA_DAC0_TX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_DAC0_TX))
#define PDMA_DAC1_TX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_DAC1_TX))
#define PDMA_SPI2_TX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_SPI2_TX))
#define PDMA_TMR0_CH0_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_TMR0_CH0))
#define PDMA_TMR0_CH1_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_TMR0_CH1))
#define PDMA_TMR1_CH0_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_TMR1_CH0))
#define PDMA_TMR1_CH1_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_TMR1_CH1))

#define PDMA_SPI0_RX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_SPI0_RX))
#define PDMA_SPI1_RX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_SPI1_RX))
#define PDMA_UART0_RX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_UART0_RX))
#define PDMA_UART1_RX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_UART1_RX))
#define PDMA_USB_RX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_USB_RX))
#define PDMA_I2S_RX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_I2S_RX))
#define PDMA_ADC_TO_CH3()		((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_ADC))
#define PDMA_SPI2_RX_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_SPI2_RX))
#define PDMA_PWM0_CH0_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_PWM0_CH0))
#define PDMA_PWM0_CH2_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_PWM0_CH2))
#define PDMA_PWM1_CH0_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_PWM1_CH0))
#define PDMA_PWM1_CH2_TO_CH3()	((uint32_t)(PDMAGCR->PDSSR0 = PDMAGCR->PDSSR0 & ~PDMA_CH3_MASK | PDMA_CH3_PWM1_CH2))
#define PDMA_DISABLE_CH3()		((uint32_t)(PDMAGCR->PDSSR0 |= PDMA_CH3_DISABLE))

/*!<Enable PDMA Channel 4 Service Selection */
#define PDMA_SPI0_TX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_SPI0_TX))
#define PDMA_SPI1_TX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_SPI1_TX))
#define PDMA_UART0_TX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_UART0_TX))
#define PDMA_UART1_TX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_UART1_TX))
#define PDMA_USB_TX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_USB_TX))
#define PDMA_I2S_TX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_I2S_TX))
#define PDMA_DAC0_TX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_DAC0_TX))
#define PDMA_DAC1_TX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_DAC1_TX))
#define PDMA_SPI2_TX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_SPI2_TX))
#define PDMA_TMR0_CH0_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_TMR0_CH0))
#define PDMA_TMR0_CH1_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_TMR0_CH1))
#define PDMA_TMR1_CH0_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_TMR1_CH0))
#define PDMA_TMR1_CH1_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_TMR1_CH1))

#define PDMA_SPI0_RX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_SPI0_RX))
#define PDMA_SPI1_RX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_SPI1_RX))
#define PDMA_UART0_RX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_UART0_RX))
#define PDMA_UART1_RX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_UART1_RX))
#define PDMA_USB_RX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_USB_RX))
#define PDMA_I2S_RX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_I2S_RX))
#define PDMA_ADC_TO_CH4()		((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_ADC))
#define PDMA_SPI2_RX_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_SPI2_RX))
#define PDMA_PWM0_CH0_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_PWM0_CH0))
#define PDMA_PWM0_CH2_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_PWM0_CH2))
#define PDMA_PWM1_CH0_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_PWM1_CH0))
#define PDMA_PWM1_CH2_TO_CH4()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH4_MASK | PDMA_CH4_PWM1_CH2))
#define PDMA_DISABLE_CH4()		((uint32_t)(PDMAGCR->PDSSR1 |= PDMA_CH4_DISABLE))

/*!<Enable PDMA Channel 5 Service Selection */
#define PDMA_SPI0_TX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_SPI0_TX))
#define PDMA_SPI1_TX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_SPI1_TX))
#define PDMA_UART0_TX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_UART0_TX))
#define PDMA_UART1_TX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_UART1_TX))
#define PDMA_USB_TX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_USB_TX))
#define PDMA_I2S_TX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_I2S_TX))
#define PDMA_DAC0_TX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_DAC0_TX))
#define PDMA_DAC1_TX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_DAC1_TX))
#define PDMA_SPI2_TX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_SPI2_TX))
#define PDMA_TMR0_CH0_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_TMR0_CH0))
#define PDMA_TMR0_CH1_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_TMR0_CH1))
#define PDMA_TMR1_CH0_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_TMR1_CH0))
#define PDMA_TMR1_CH1_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_TMR1_CH1))

