xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Include/nano1xx_pdma.h
#define PDMA_SPI0_RX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_SPI0_RX))
#define PDMA_SPI1_RX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_SPI1_RX))
#define PDMA_UART0_RX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_UART0_RX))
#define PDMA_UART1_RX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_UART1_RX))
#define PDMA_USB_RX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_USB_RX))
#define PDMA_I2S_RX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_I2S_RX))
#define PDMA_ADC_TO_CH5()		((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_ADC))
#define PDMA_SPI2_RX_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_SPI2_RX))
#define PDMA_PWM0_CH0_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_PWM0_CH0))
#define PDMA_PWM0_CH2_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_PWM0_CH2))
#define PDMA_PWM1_CH0_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_PWM1_CH0))
#define PDMA_PWM1_CH2_TO_CH5()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH5_MASK | PDMA_CH5_PWM1_CH2))
#define PDMA_DISABLE_CH5()		((uint32_t)(PDMAGCR->PDSSR1 |= PDMA_CH5_DISABLE))

/*!<Enable PDMA Channel 6 Service Selection */
#define PDMA_SPI0_TX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_SPI0_TX))
#define PDMA_SPI1_TX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_SPI1_TX))
#define PDMA_UART0_TX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_UART0_TX))
#define PDMA_UART1_TX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_UART1_TX))
#define PDMA_USB_TX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_USB_TX))
#define PDMA_I2S_TX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_I2S_TX))
#define PDMA_DAC0_TX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_DAC0_TX))
#define PDMA_DAC1_TX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_DAC1_TX))
#define PDMA_SPI2_TX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_SPI2_TX))
#define PDMA_TMR0_CH0_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_TMR0_CH0))
#define PDMA_TMR0_CH1_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_TMR0_CH1))
#define PDMA_TMR1_CH0_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_TMR1_CH0))
#define PDMA_TMR1_CH1_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_TMR1_CH1))

#define PDMA_SPI0_RX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_SPI0_RX))
#define PDMA_SPI1_RX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_SPI1_RX))
#define PDMA_UART0_RX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_UART0_RX))
#define PDMA_UART1_RX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_UART1_RX))
#define PDMA_USB_RX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_USB_RX))
#define PDMA_I2S_RX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_I2S_RX))
#define PDMA_ADC_TO_CH6()		((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_ADC))
#define PDMA_SPI2_RX_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_SPI2_RX))
#define PDMA_PWM0_CH0_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_PWM0_CH0))
#define PDMA_PWM0_CH2_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_PWM0_CH2))
#define PDMA_PWM1_CH0_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_PWM1_CH0))
#define PDMA_PWM1_CH2_TO_CH6()	((uint32_t)(PDMAGCR->PDSSR1 = PDMAGCR->PDSSR1 & ~PDMA_CH6_MASK | PDMA_CH6_PWM1_CH2))
#define PDMA_DISABLE_CH6()		((uint32_t)(PDMAGCR->PDSSR1 |= PDMA_CH6_DISABLE))


/*@}*/ /* end of group NANO1xx_PDMA_EXPORTED_CONSTANTS */



/******************************************************************************/
/*                DMA Specific Structure                                      */
/******************************************************************************/
/** @addtogroup NANO1xx_PDMA_EXPORTED_STRUCTS PDMA Exported Structs
  @{
*/

/*!<PDMA Channel Structure */
typedef struct DRVPDMA_STRUCT		/* PDMA structure */
{
    uint32_t	SrcCtrl;    	    /* Source Transfer direction */
	uint32_t	SrcAddr;			/* Source Start Address */
	uint32_t	DestCtrl;		    /* Destination Transfer direction */
	uint32_t	DestAddr;			/* Destination Start Address */
    uint32_t	TransWidth;			/* Transfer Width */
    uint32_t	Mode;				/* Operation Mode */
	uint32_t	ByteCnt;			/* Byte Count */
    uint32_t	IsTimeOutEnable;	/* Enable Timeout function */
}STR_PDMA_T;

/*!<VDMA Channel Structure */
typedef struct DRVVDMA_STRUCT		/* VDMA structure */
{
	uint32_t	Dir;
    uint32_t	SrcAddr;			/* Start Address */
    uint32_t	DestAddr;			/* Start Address */
	uint32_t	ByteCnt;			/* Byte Count */
    uint32_t	IsStrideEnable;		/* Stride Mode Enable */
	uint16_t	u16Stbc;			/* Stride Transfer Byte Count */
	uint16_t	u16Sastobl;			/* Source Address Stride Offset Byte Length */
	uint16_t	u16Dastobl;			/* Destination Address Stride Offset Byte Length */
}STR_VDMA_T;

typedef struct DRVCRC_STRUCT			/* CRC structure */
{
	uint32_t	u32Mode;
    uint32_t	u32CPUWdlen;			/* CPU write data length */
    uint8_t		bIsChecksumComplement;	/* Checksum Complement */
    uint8_t		bIsWriteDataComplement;	/* Write Data Complement */
    uint8_t		bIsChecksumReverse;		/* Checksum Reverse */
    uint8_t		bIsWriteDataReverse;	/* Write Data Order Reverse */
    uint32_t	u32DMASrcAddr;			/* DMA Start Address */
	uint16_t	u16DMAByteCnt;			/* DMA Byte Count */
}STR_CRC_T;


/*@}*/ /* end of group NANO1xx_PDMA_EXPORTED_STRUCTS */


/******************************************************************************/
/*                DMA Specific inline                                         */
/******************************************************************************/
/** @addtogroup NANO1xx_PDMA_EXPORTED_FUNCTIONS PDMA Exported Functions
  @{
*/

/**   
  * @brief  DMA Initial, Enable clock.
  * @param  None.
  * @retval None.
  */
static __INLINE void PDMA_Init()
{
	CLK->AHBCLK |= CLK_AHBCLK_DMA_EN;
}

/**   
  * @brief  DMA DeInit, Disable clock.
  * @param  None.
  * @retval None.
  */
static __INLINE void PDMA_DeInit()
{
	CLK->AHBCLK &= ~CLK_AHBCLK_DMA_EN;
}

/**   
  * @brief  PDMA_EnableChannelClock, Enable Channel Clock.
  * @param  ch: initial PDMA channel.
  * @retval None.
  */
static __INLINE void PDMA_EnableChannelClock(uint32_t ch)
{
	PDMAGCR->CSR |= ch;
}

/**   
  * @brief  PDMA_SetTransferSetting, configures PDMA setting.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @param  u32SrcAddr: Source Address.
  * @param  u32DestAddr: Destination Address.
  * @param  u32TransferLength: Byte Count.
  * @retval None.
  */
static __INLINE void PDMA_SetTransferSetting(PDMA_TypeDef *ch, uint32_t u32SrcAddr, uint32_t u32DestAddr, uint32_t u32TransferLength)
{
	ch->SAR = u32SrcAddr;			/* Set Source Address */
	ch->DAR = u32DestAddr;			/* Set Destination Address */
	ch->BCR = u32TransferLength;	/* Set Byte Count Register */
}

/**   
  * @brief  PDMA_IsCHBusy, Get Channel Enable/Disable status.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @retval 1: The Channel is busy; 0: The Channel is usable.
  */
static __INLINE int32_t PDMA_IsCHBusy(PDMA_TypeDef *ch)
{
	return (ch->CSR & PDMA_CSR_TRIG_EN)? TRUE: FALSE;
}

/**   
  * @brief  PDMA_GetTransferLength, Get channel transfer length setting.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @retval transfer length.
  */
static __INLINE uint32_t PDMA_GetTransferLength(PDMA_TypeDef *ch)
{
	return (ch->BCR);
}

/**   
  * @brief  PDMA_SetAPBTransferWidth, set APB transfer width.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @param  TransferWidth: Transfer width.
  * @retval None.
  */
static __INLINE void PDMA_SetAPBTransferWidth(PDMA_TypeDef *ch, uint32_t TransferWidth)
{
	ch->CSR = ch->CSR & ~PDMA_CSR_APB_TWS_MASK | TransferWidth;
}

/**   
  * @brief  PDMA_CHSoftwareReset, do software reset Channel.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @retval None.
  */
static __INLINE void PDMA_CHSoftwareReset(PDMA_TypeDef *ch)
{
	ch->CSR |= PDMA_CSR_SWRST;
}

/**   
  * @brief  PDMA_CHEnableTransfer, enable PDMA channelx and trigger channel.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @retval None.
  */
static __INLINE void PDMA_CHEnableTransfer(PDMA_TypeDef *ch)
{
	ch->CSR |= (PDMA_CSR_CEN|PDMA_CSR_TRIG_EN);
}

/**   
  * @brief  PDMA_CHDisableTransfer, disable PDMA channelx and trigger channel.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @retval None.
  */
static __INLINE void PDMA_CHDisableTransfer(PDMA_TypeDef *ch)
{
	ch->CSR |= PDMA_CSR_SWRST;
	ch->CSR &= ~PDMA_CSR_CEN;
}

/**   
  * @brief  PDMA_DisableInt, Disable Interrupt for channel.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @param  IntSource: Intterrupt source.
  * @retval None.
  */

static __INLINE void PDMA_DisableInt(PDMA_TypeDef *ch, uint32_t IntSource)
{
	ch->IER &= ~IntSource;
}

/**   
  * @brief  PDMA_IsIntEnabled, Disable Interrupt for channel.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @param  IntSource: Intterrupt source.
  * @retval 1: The Specified Source Interrupt is enable.
  * @retval 0: The Specified Source Interrupt is disable.
  */

static __INLINE uint32_t PDMA_IsIntEnabled(PDMA_TypeDef *ch, uint32_t IntSource)
{
	return (ch->IER & IntSource)? TRUE: FALSE;
}

/**   
  * @brief  PDMA_ClearIntFlag, clear interrupt status for channel.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @param  IntFlag: Intterrupt source.
  * @retval None.
  */

static __INLINE void PDMA_ClearIntFlag(PDMA_TypeDef *ch, uint32_t IntFlag)
{
	ch->ISR |= IntFlag;
}

/**   
  * @brief  PDMA_PollInt, polling Interrupt for channel.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @param  IntFlag: Intterrupt source.
  * @retval 1: The Source Interrupt Flag is set .
  * @retval 0: The Source Interrupt Flag is clear.
  */

static __INLINE uint32_t PDMA_PollInt(PDMA_TypeDef *ch, uint32_t IntFlag)
{
	return (ch->ISR & IntFlag)? TRUE: FALSE;
}

/**   
  * @brief  PDMA_GetSharedBufData, Get shared buffer content for channel.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @retval Shard Buffer Content register.
  */

static __INLINE uint32_t PDMA_GetSharedBufData(PDMA_TypeDef *ch)
{
	return ch->BUF0;
}

/**   
  * @brief  PDMA_SetTimeOutCount, set timeout count to dma channel.
  *         The reference clock is internal 10K. The clock is (count * (1/10K)) second.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @param  Count: timeout Count: 0 ~ 0xffff.
  * @retval None.
  */
static __INLINE void PDMA_SetTimeOutCount(PDMA_TypeDef *ch, uint32_t Count)
{
	ch->TCR = Count;
}

/**   
  * @brief  PDMA_GetCurrentSourceAddr, Get current source address from channel.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @retval Current Source Address.
  */

