xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Include/nano1xx_pdma.h
static __INLINE uint32_t PDMA_GetCurrentSourceAddr(PDMA_TypeDef *ch)
{
	return ch->CSAR;
}

/**   
  * @brief  PDMA_GetCurrentDestAddr, Get current destination address from channel.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @retval Current destination Address.
  */

static __INLINE uint32_t PDMA_GetCurrentDestAddr(PDMA_TypeDef *ch)
{
	return ch->CDAR;
}

/**   
  * @brief  PDMA_GetRemainTransferCount, Get current remained byte count of channel.
  * @param  ch: PDMA Source channel, PDMA1 ~ PDMA6.
  * @retval Current remained byte count.
  */

static __INLINE uint32_t PDMA_GetRemainTransferCount(PDMA_TypeDef *ch)
{
	return ch->CBCR;
}

/**   
  * @brief  PDMA_SetVDMATransferSetting, configures VDMA setting.
  * @param  u32Stbc: VDMA Stride Transfer Byte Count (0 ~ 0xffff).
  * @param  u32Sastobl: VDMA Source Address Stride Offset Byte Length (0 ~ 0xffff).
  * @param  u32Dastobl: VDMA Destination Address Stride Offset Byte Length (0 ~ 0xffff).
  * @retval None.
  */
static __INLINE void PDMA_SetVDMATransferSetting(uint32_t u32Stbc, uint32_t u32Sastobl, uint32_t u32Dastobl)
{
	VDMA->SASOCR = (u32Stbc << 16) | u32Sastobl;
	VDMA->DASOCR = u32Dastobl;			/* Set Destination Address Stride Offset Byte Length */
}

/**   
  * @brief  PDMA_SetCRCTransfer, configures CRC setting.
  * @param  u32SrcAddr: DMA source address.
  * @param  u16ByteCount: DMA transfer byte count.
  * @param  u32SeedValue: CRC seed.
  * @retval None.
  */
static __INLINE void PDMA_SetCRCTransfer(uint32_t u32SrcAddr, uint16_t u16ByteCount, uint32_t u32SeedValue)
{
	PDMACRC->DMASAR = u32SrcAddr;		/* Set Source Address */
	PDMACRC->DMABCR = u16ByteCount;		/* Set Byte Count Register */
	PDMACRC->SEED   = u32SeedValue;		/* Set Seed Register */
}

/**   
  * @brief  PDMA_IsCRCBusy, Get CRC Enable/Disable status.
  * @param  None.
  * @retval 1: The Channel is busy; 0: The Channel is usable.
  */
static __INLINE int32_t PDMA_IsCRCBusy()
{
	return (PDMACRC->CTL & PDMACRC_CTL_TRIG_EN)? TRUE: FALSE;
}

/**   
  * @brief  PDMA_SetCRCPolynomialMode, Set CRC Polynomial Mode.
  * @param  mode: CRC Polynomial Mode.
  * @retval None.
  */
static __INLINE void PDMA_SetCRCPolynomialMode(uint32_t mode)
{
	PDMACRC->CTL = PDMACRC->CTL & ~PDMACRC_CTL_MODE_MASK | mode;
}

/**   
  * @brief  PDMA_SetCRCCPUWriteDataLength, Set CRC CPU Write Data length.
  * @param  Wdlen: CPU Write Data length.
  * @retval None.
  */
static __INLINE void PDMA_SetCRCCPUWriteDataLength(uint32_t Wdlen)
{
	PDMACRC->CTL = PDMACRC->CTL & ~PDMACRC_CTL_CPU_WDLEN_MASK | Wdlen;
}

/**   
  * @brief  PDMA_CRCSoftwareReset, do software reset CRC.
  * @param  None.
  * @retval None.
  */
static __INLINE void PDMA_CRCSoftwareReset()
{
	PDMACRC->CTL |= PDMACRC_CTL_RST;
}

/**   
  * @brief  PDMA_CRCEnablelTransfer, enable and trigger CRC.
  * @param  None.
  * @retval None.
  */
static __INLINE void PDMA_CRCEnablelTransfer()
{
	PDMACRC->CTL |= (PDMA_CSR_CEN|PDMA_CSR_TRIG_EN);
}

/**   
  * @brief  PDMA_CRCDisableInt, Disable CRC Interrupt.
  * @param  IntSource: Intterrupt source.
  * @retval None.
  */

static __INLINE void PDMA_CRCDisableInt(uint32_t IntSource)
{
	PDMACRC->DMAIER &= ~IntSource;
}

/**   
  * @brief  PDMA_CRCClearIntFlag, clear CRC interrupt status.
  * @param  IntFlag: Intterrupt source.
  * @retval None.
  */

static __INLINE void PDMA_CRCClearIntFlag(uint32_t IntFlag)
{
	PDMACRC->DMAISR |= IntFlag;
}

/**   
  * @brief  PDMA_CRCPollInt, polling CRC Interrupt.
  * @param  IntFlag: Intterrupt source.
  * @retval 1: The Source Interrupt Flag is set .
  * @retval 0: The Source Interrupt Flag is clear.
  */

static __INLINE uint32_t PDMA_CRCPollInt(uint32_t IntFlag)
{
	return (PDMACRC->DMAISR & IntFlag)? TRUE: FALSE;
}

/**   
  * @brief  PDMA_CRCSetWriteData, write data into Write Data Register.
  * @param  u32Data Data to write into data register
  * @retval None.
  */
static __INLINE void PDMA_CRCSetWriteData(uint32_t u32Data)
{
	PDMACRC->WDATA = u32Data;
}

/**   
  * @brief  PDMA_CRCGetWriteData, read data from Write Data Register.
  * @param  None.
  * @retval read data from Write Data Register.
  */
static __INLINE uint32_t PDMA_CRCGetWriteData()
{
	return (PDMACRC->WDATA);
}

/**   
  * @brief  PDMA_CRCSetSeed, set CRC seed Register.
  * @param  u32Data CRC seed
  * @retval None.
  */
static __INLINE void PDMA_CRCSetSeed(uint32_t u32Data)
{
	PDMACRC->SEED = u32Data;
}

/**   
  * @brief  PDMA_CRCGetChecksum, read data from Write Data Register.
  * @param  None.
  * @retval read data from Write Data Register.
  */
static __INLINE uint32_t PDMA_CRCGetChecksum(void)
{
	return (PDMACRC->CHECKSUM & PDMACRC->SEED);
}


/***********************************************/
void PDMA_Close(void);
void PDMA_Open(PDMA_TypeDef *ch, STR_PDMA_T *sParam);
void PDMA_OpenVDMA(STR_VDMA_T *sParam);
void PDMA_EnableInt(PDMA_TypeDef *ch, uint32_t IntSource);
void PDMA_OpenCRC(STR_CRC_T *sParam);
void PDMA_CRCEnableInt(uint32_t IntSource);

/*@}*/ /* end of group NANO1xx_PDMA_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NANO1xx_PDMA_Driver */

/*@}*/ /* end of group NANO1xx_Device_Driver */

#ifdef  __cplusplus
}
#endif

#endif	// __NANO1XX_PDMA_H

/*** (C) COPYRIGHT 2012 Nuvoton Technology Corp. ***/













